In [16]:
import pandas as pd
df = pd.read_excel('score.xlsx')
df.index.name='지원번호'
df.sort_index(inplace=True)
df.to_excel('score.xlsx')
df

      Unnamed: 0  8번  승근열  단지고  190  100   85   90  95  95.1          c#
지원번호
0              0  7번  박혜정  단지고  188   55   65   45  40    35      PYTHON
1              1  6번  박동현  단지고  202   80  100   95  85    80           C
2              2  5번  김재욱  구로고  188   15   20   10  35    10         NaN
3              3  4번  김수찬  구로고  187   40   60   70  75    80         NaN
4              4  3번  강호림  구로고  168   80   75   70  80    75  javascript
5              5  2번  강태원  구로고  184   40   35   50  55    25        Java
6              6  1번  강나래  구로고  197   90   85  100  95    85      Python

In [4]:
df.columns # 모든 컬럼을 보여줌

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'sw특기'], dtype='object')

In [7]:
# int,float타입의 개수, 최소값, 최대값
df['키'].describe() # 전체

count      8.000000
mean     188.000000
std        9.985704
min      168.000000
25%      186.250000
50%      188.000000
75%      191.750000
max      202.000000
Name: 키, dtype: float64

In [15]:
# 각 컬럼별 평균, 최대값, 최소값 등 통계를 출력
df['키'].mean()
df['키'].count() # 개수

df['키'].min() # 최소값
df['키'].max() # 최대값

202

In [18]:
df.info #컬럼별 간단하게

<bound method DataFrame.info of        이름   학교    키   국어   영어   수학  과학  사회        sw특기
지원번호
8번    승근열  단지고  190  100   85   90  95  95          c#
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON
6번    박동현  단지고  202   80  100   95  85  80           C
5번    김재욱  구로고  188   15   20   10  35  10         NaN
4번    김수찬  구로고  187   40   60   70  75  80         NaN
3번    강호림  구로고  168   80   75   70  80  75  javascript
2번    강태원  구로고  184   40   35   50  55  25        Java
1번    강나래  구로고  197   90   85  100  95  85      Python>

In [20]:
df.head() # 입력한만큼 상단 보여줌

       이름   학교    키   국어   영어  수학  과학  사회    sw특기
지원번호
8번    승근열  단지고  190  100   85  90  95  95      c#
7번    박혜정  단지고  188   55   65  45  40  35  PYTHON
6번    박동현  단지고  202   80  100  95  85  80       C
5번    김재욱  구로고  188   15   20  10  35  10     NaN
4번    김수찬  구로고  187   40   60  70  75  80     NaN

In [3]:
df = pd.read_csv('stu_score1.csv',encoding='utf-8-sig')
df

NameError: name 'pd' is not defined

In [31]:
df.head() 
df.tail() # 아래에 부터 입력한 값만큼 불러옴

       no      name  kor  eng  math  total        avg  rank      c_date
995   996     Danna   59   64    51    174  58.000000     0  2024-04-01
996   997  Gilberta   89   53    54    196  65.333333     0  2024-04-06
997   998    Pansie   63   82    78    223  74.333333     0  2024-04-02
998   999   Laurena   61   60    96    217  72.333333     0  2024-04-07
999  1000   Klemens   83   64    56    203  67.666667     0  2024-04-08

In [34]:
# rows,columns 개수를 보여줌
df.shape

(1000, 9)

In [37]:
# 각각의 rows 데이터들을 배열로 생성
df.values
df.values[0:5]

array([[1, 'Michell', 55, 87, 68, 210, 70.0, 0, '2024-04-04'],
       [2, 'Ricard', 73, 69, 77, 219, 73.0, 0, '2024-04-01'],
       [3, 'Goraud', 92, 97, 90, 279, 93.0, 0, '2024-04-04'],
       [4, 'Melli', 98, 60, 78, 236, 78.6666666667, 0, '2024-04-04'],
       [5, 'Jo-ann', 66, 72, 59, 197, 65.6666666667, 0, '2024-04-06']],
      dtype=object)

In [40]:
df.index # index 출력

RangeIndex(start=0, stop=1000, step=1)

In [43]:
df.columns # 컬럼출력

Index(['no', 'name', 'kor', 'eng', 'math', 'total', 'avg', 'rank', 'c_date'], dtype='object')

In [2]:
df = pd.read_excel('score.xlsx',index_col='지원번호')
df

NameError: name 'pd' is not defined

In [56]:
df.columns 
df.columns[0] # 이름
df[df.columns[0]] # 처음 컬럼의 데이터를 출력,df['이름'] 과 같음
df[df.columns[-1]] # 제일 마지막 컬럼의 데이터를 출력
# df['이름']

지원번호
1번        Python
2번          Java
3번    javascript
4번           NaN
5번           NaN
6번             C
7번        PYTHON
8번            c#
Name: sw특기, dtype: object

### 데이터 확인

In [6]:
df.describe() # 컬럼별 대략적인 정보, 최소값,최대값, 평균 등 확인
df.head() # 상단 5개 출력
df.tail() # 하단 5개 출력
df.info() # 컬럼별 타입,크기 정보
df.values # rows데이터 배열로 출력
df.index # index 정보
df.columns # 컬럼 정보
df.shape # 데이터 크기 정보(rows,columns)

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1번 to 8번
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   과학      8 non-null      int64
 7   사회      8 non-null      int64
 8   sw특기    6 non-null      object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

(8, 9)

In [8]:
df.shape
df.shape[1] # 컬럼의 개수

8